

def area(a, b):
    """
    Возвращает площадь прямоугольника

        Параметры:
            a (float): длина первой стороны прямоугольника
            b (float): длина второй стороны прямоугольника

        Возвращаемое значение:
            area (float): площадь прямоугольника
    """
    return a * b


def perimeter(a, b):
    """
    Возвращает периметр прямоугольника

        Параметры:
            a (float): длина первой стороны прямоугольника
            b (float): длина второй стороны прямоугольника

        Возвращаемое значение:
            area (float): периметр прямоугольника
    """
    return 2 * (a + b)
