
def area(a, b):
    '''
  Определяем функцию с названием area, которая принимает 2 числа, a - длина прямоугольника ,b - ширина прямоугольника

        Параметры:
           a(int) - целочисленное  значение
           b(int) - целочисленное  значение
        
        Возвращаемое значение:
           Площадь прямоугольника со значением (int) 

  '''
    return a * b 

def perimeter(a, b):
    '''
   Определяем функцию с названием perimeter, которая принимает 2 числа, a - длина прямоугольника ,b - ширина прямоугольника

         Параметры:
           a(int) - целочисленное  значение
           b(int) - целочисленное  значение
         
         Возвращаемое значение:
           Периметр прямоугольника за значением int 

   '''
    return (a + b)*2 
