def area(a, b):
    """ Возвращает площадь прямоугольника
            Параметры:
                a (int): одна сторона квадрата
                b (int): вторая сторона квадрата
            Возвращаемое значение:
                area (int): площадь прямоугольника
    """
    return a * b


def perimeter(a, b):
    """ Возвращает периметр прямоугольника
            Параметры:
                a (int): одна сторона квадрата
                b (int): вторая сторона квадрата
            Возвращаемое значение:
                perimeter (int): периметр прямоугольника
    """
    return 2 * (a + b)
