def area(a, b):
    '''
        Возвращает произведение двух чисел.
            Параметры:
                    a: первое число
                    b: второе число
            Возвращаемое значение:
                    area: число равное произведению a и b (площадь прямоугольника)
        '''
    return a * b


def perimeter(a, b):
    return 2*(a + b)
    '''
    Возвращает произведение удвоенную сумму двух чисел.
            Параметры:
                    a: первое число
                    b: второе десятичное число
            Возвращаемое значение:
                perimeter: число равное удвоенной сумме a и b
    '''

