def area(a, b):
    '''
    Возвращает площадь прямоугольника (a, b) в виде числа:
        Параметры:
                a (int) : Первая сторона прямоугольника
                b (int) : Вторая сторона прямоугольника
        Возвращаемое значение:
                a * b
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника (a, b) в виде числа:
        Параметры:
                a (int) : Первая сторона прямоугольника
                b (int) : Вторая сторона прямоугольника
        Возвращаемое значение:
                a + b
    '''
    return 2 * (a + b)

