def area(a, b):
    '''
    Возвращает площадь прямоугольника по алгебраической формуле.
    Параметры:
        a (int): десятичное число
        b (int): десятичное число
    Возвращаемое значение:
        a * b (int): значение вычисленной площади
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по алгебраической формуле.
    Параметры:
        a (int): десятичное число
        b (int): десятичное число
    Возвращаемое значение:
        (a + b)*2 (int): периметр прямоугольника
        '''
    return (a + b)*2