def area(a, b):
    """
    Функция возвращает площадь прямоугольника, то есть десятичное число произведение a на b

    Параметры:
        a(int): первое десятичное число
        b(int): второе десятичное число

    Возвращаемое значение:
        a * b: десятичное число произведение a на b
    """
    return a * b

def perimetr(a, b):
    """
    Функция возвращает периметр прямоугольника, то есть детяичное число 
    произвдение числа два на сумму a и b

    Параметры:
        a(int): первое десятичное число
        b(int): второе десятичное число

    Возвращаемое значение:
        (a + b) * 2: десятичное число произведение числа два на сумму a и b
    """
    return (a + b) * 2
