def area(a, b):
    '''
    Возвращает площадь прямоугольника по заданным сторонам.

        Параметры:
            a (int): длина прямоугольника
            b (int): ширина прямоугольника

        Возвращаемые значения:
            area (int): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по заданным сторонам.

        Параметры:
            a (int): длина прямоугольника
            b (int): ширина прямоугольника

        Возвращаемые значения:
            perimetr (int): периметр прямоугольника
    '''
    return 2*(a + b)

