def area(a, b):
    '''
    Принимает числа a и b, возвращает произведение чисел a и b
        Параметры:
            a (int): десятичное число
            b (int): десятичное число
        Возвращаемое значение:
            area (int): произведение чисел a и b
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Принимает числа a и b, возвращает удвоенную сумму чисел a и b
        Параметры:
            a (int): десятичное число
            b (int): десятичное число
        Возвращаемое значение:
            perimeter (int): удвоенная сумма чисел a и b
    '''
    return 2*(a + b) 