def area(a, b):
    '''
        Возвращает площадь прямоугольника по сторонам.

            Параметры:
                a (int): высота прямоугольника
                b (int): ширина прямоугольника

            Возвращаемое значение:
                area (int): площадь прямоугольника со сторонами a и b
    '''
    return a * b
def perimeter(a, b):
    '''
            Возвращает периметр прямоугольника по сторонам.

                Параметры:
                    a (int): высота прямоугольника
                    b (int): ширина прямоугольника

                Возвращаемое значение:
                    perimeter (int): периметр прямоугольника со сторонами a и b
    '''
    return (a + b) * 2
