def area(a, b):
    '''
    Возвращает произведение двух чисел.
    :param a: первое десятичное число
    :param b: второе десятичное число
    :return: число, состоящее из произведения двух входных десятичных чисел.
    '''
    return a * b 

def perimeter(a, b):
    '''
    Возвращает удвоенную сумму двух чисел.
    :param a: первое десятичное число
    :param b: второе десятичное число
    :return: число, состоящее из удвоенной суммы двух входных десятичных чисел.
    '''
    return 2*(a + b)
