def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a(int): сторона a прямоугольника
            b(int): сторона b прямоугольника
        
        Возвращенное значение:
            a * b (int): площадь прямоугольника 
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a(int): сторона a прямоугольника
            b(int): сторона b прямоугольника 
        
        Возвращенное значение:
            (a + b) * 2 (int): площадь прямоугольника 
    '''
    return (a + b)*2