def area(a, b): 
    '''
    Функция принимает два параметра: a - длина одной стороны прямоугольника, b - длина другой стороны прямоугольника.
    Возвращает значение площади прямоугольника, вычисленной по формуле a * b.
    '''

    return a * b 

def perimeter(a, b): 
    '''
    Функция принимает два параметра: a - длина одной стороны прямоугольника, b - длина другой стороны прямоугольника.
    Возвращает значение периметра прямоугольника, вычисленное как (a + b) * 2.
    '''
    
    return (a + b) * 2

