def area(a, b):
    '''
    возвращает площадь прямоугольника, вычисленную как произведение двух сторон

    параметры:
    a: первая длина стороны прямоугольника
    b: вторая длина стороны прямоугольника

    возращаемое значение:
    a * b: площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    возвращает периметр прямоугольника, вычисленный как удвоенная сумма двух сторон

    параметры:
    a: первая длина стороны прямоугольника
    b: вторая длина стороны прямоугольника

    возвращаемое значение:
    (a+b)*2: периметр прямоугольника
    '''
    return (a + b)*2 
