def area(a, b):
    """
    Возвращает площадь прямоугольника.

    Параметры:
    a (int, float): первая сторона прямоугольника.
    b (int, float): вторая сторона прямоугольника.

    Возвращаемое значение:
    float: площадь прямоугольника.
    """
    return a * b

def perimeter(a, b):
    """
    Возвращает периметр прямоугольника.

    Параметры:
    a (int, float): первая сторона прямоугольника.
    b (int, float): вторая сторона прямоугольника.

    Возвращаемое значение:
    float: периметр прямоугольника.
    """
    return 2 * (a + b)
