def area(a, b): 
    '''
    Определяем функцию area - площадь, которая принимает значения a и b - стороны прямоугольника

        Параметры:
            a (int) или (float) - целое число или число с плавающей точкой
            b (int) или (float) - целое число или число с плавающей точкой

        Возвращаемое значение:
            Площадь прямоугольника со значением (int) или (float)
    '''
    return a * b 

def perimeter(a, b):
    '''
    Определяем функцию perimeter - периметр, которая принимает значения a и b - стороны прямоугольника

        Параметры:
            a (int) или (float) - целое число или число с плавающей точкой
            b (int) или (float) - целое число или число с плавающей точкой

        Возвращаемое значение:
            Периметр прямоугольника со значением (int) или (float)
    '''
    return (a + b) * 2 
