def area(a):
    '''
    Возвращает площадь квадрата со стороной a

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            square_area (int): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a

        Параметры:
            a (int): сторона квадрата

        Возвращаемое значение:
            square_perimeter (int): периметр квадрата со стороной a
    '''
    return 4 * a
