
def area(a):
'''
    Возвращает площадь квадрата с указанной стороной
    
        Параметры:
            a (int/float): длина стороны квадрата
        Возвращаемое значение:
             area (int/float): площадь квадрата со стороной a
'''
    return a * a


def perimeter(a):
'''
    Возвращает периметр квадрата с указанной стороной
    
        Параметры:
            a (int/float): длина стороны квадрата
            
        Возвращаемое значение:
            perimeter (int/float): периметр квадрата со стороной a
'''
    return 4 * a
