def area(a):
    '''
    Определяем функцию area - площадь, которая принимает значения a - сторона квадрата

        Параметры:
            a (int) или (float) - целое число или число с плавающей точкой

        Возвращаемое значение:
            Площадь квадрата со значением (int) или (float)
    '''
    return a * a


def perimeter(a):
    '''
Определяем функцию perimeter - периметр, которая принимает значения a - сторона квадрата

    Параметры:
        a (int) или (float) - целое число или число с плавающей точкой

    Возвращаемое значение:
        Периметр квадрата со значением (int) или (float)
'''
    return 4 * a
