def area(a):
    """
    Функция возвращает квдарат числа a, т.е. площадь круга

    Параметры:
        a(int): единственное десятичное число

    Возвращаемое значение:
        a * a: десятичное число квадрат числа a
    """

    return a * a


def perimeter(a):
    """
    Функция возвращает число a умноженое на 4, т.е. периметр круга

    Параметры:
        a(int): единственное десятичное число
    
    Возвращаемое значение:
        4 * a: десятичное число 4 умножить на a
    """
    return 4 * a
