
def area(a):
    '''Возвращает квадратную площадь.

            Параметры:
                a (int): сторона квадрата
            Возвращает:
                (int): площадь квадрата

            Пример вызова:
                area(3) = 9
    '''

    return a * a


def perimeter(a):
    '''Возвращает периметр квадрата.

            Параметры:
                a (int): сторона квадрата
            Возвращает:
                (int): периметр квадрата
            
            Пример вызова:
                area(3) = 12
    '''

    return 4 * a

