
def area(a):
    '''
    Определяем функцию с названием area, которая принимает значение числа а - сторону квадрата

      Параметры:
         a(int) - целочисленное  значение

      Возвращаемое значение:
         Площадь квадрата со значением (int)

    '''
    return a * a


def perimeter(a):
    '''
    Определяем функцию с названием perimeter, которая принимает значение числа а - сторону квадрата

      Параметры:
         a(int) - целочисленное  значение

      Возвращаемое значение:
         Периметер квадрата со значением (int)

    '''
    return 4 * a
