
def area(a):
    '''
            Возвращает площадь квадрата по стороне.

                Параметры:
                    a (int): сторона квадратра

                Возвращаемое значение:
                    area (int): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
            Возвращает периметр квадрата по стороне.

                Параметры:
                    a (int): сторона квадратра

                Возвращаемое значение:
                    perimetr (int): периметр квадрата со стороной a
    '''
    return 4 * a
