
def area(a):
    '''
        Возвращает площадь квадрата по заданной стороне.

            Параметры:
                a (int): сторона квадрата

            Возвращаемые значения:
                area (int): площадь квадрата
        '''
    return a * a


def perimeter(a):
    '''
            Возвращает периметр квадрата по заданной стороне.

                Параметры:
                    a (int): сторона квадрата

                Возвращаемые значения:
                    area (int): периметр квадрата
            '''
    return 4 * a
