
def area(a):
        '''Возвращает площадь квадрата с заданной длиной стороны

        Параметры:
                a (int): длина стороны квадрата

        Возвращаемое значение:
                area (int): Квадрат числа a

        Пример вызова: area(3) => 9
        '''
    return a * a


def perimeter(a):
    '''Возвращает периметр квадрата с заданной длиной стороны

        Параметры:
                a (int): длина стороны квадрата

        Возвращаемое значение:
                perimeter (int): Умноженное на 4 число a

        Пример вызова: area(3) => 12
        '''
    return 4 * a
