def area(a, h):
    """
    Функция, которая вычисляет площадь треугольника по его основанию и высоте.

    Args:
        a (float): Основание треугольника.
        h (float): Высота треугольника.

    Returns:
        float: Площадь треугольника.
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Функция, которая вычисляет периметр треугольника по его сторонам.

    Args:
        a (float): Первая сторона треугольника.
        b (float): Вторая сторона треугольника.
        c (float): Третья сторона треугольника.

    Returns:
        float: Периметр треугольника.
    """
    return a + b + c

