def area(a, h):
    '''
    возвращает площадь треугольника, вычисленную как произведение длины его основания на высоту, деленную на два

    параметры:
    a: длина основания
    b: высота треугольника

    возвращаемое значение:
    a * h/2: площадь треугольника
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    возвращает периметр треугольника, вычисляемый как сумма трех сторон

    параметры:
    a: длина стороны треугольника
    b: длина стороны треугольника

    возвращаемое значение:
    a + b + c: периметр треугольника
    '''
    return a + b + c 
