def area(a, h):
    """
    Функция принимает два значения a, h и возваращает площадь прямоугольника со сторонами a и h

    Параметры: 
        a(int): Первое десятичное число
        h(int): Второе десятичное число
        
    Возвращаемое значение:
        a * h / 2 : десятичное число произведения a на h и их частное от деления на 2
    """
    return a * h / 2

def perimetr(a, b, c):
    """
    Функция принимает три значения и возвращает их сумму, т.е. периметр треугольника

    Параметры:
        a(int): первое десятичное число
        b(int): второе десятичное число
        c(int): третье десятичное число

    Возвращаемое значение:
        a + b + c: десятичное число, сумма a, b, c
    """

    return a + b + c
