
def area(a, h):

    '''
   Определяем функцию с названием area, которая принимает 2 числа, a - сторона треуголльника,h - высота треугольника

         Параметры:
            a(int) или (float) -целочисленные или вещественные значения
         
         Возвращаемое значение:
            Площадь треугольника со значением (int) или (float)

   '''
    
    return a * h / 2 

def perimeter(a, b, c):

    '''
   Определяем функцию с названием perimeter, которая принимает 3 числа: a,b,c - стороны треугольника

         Параметры:
            a(int) или (float) -целочисленные или вещественные значения
            b(int) или (float) -целочисленные или вещественные значения
            c(int) или (float) -целочисленные или вещественные значения
         
         Возвращаемое значение:
            Периметр треугольника со значением (int) или (float)

   '''
    return a + b + c 
