def area(a, h):
    """
    Возвращает площадь треугольника.

    Параметры:
    a (int, float): основание треугольника.
    h (int, float): высота треугольника.

    Возвращаемое значение:
    float: площадь треугольника.
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Возвращает периметр треугольника.

    Параметры:
    a (int, float): первая сторона треугольника.
    b (int, float): вторая сторона треугольника.
    c (int, float): третья сторона треугольника.

    Возвращаемое значение:
    float: периметр треугольника.
    """
    return a + b + c

