def area(a, h):
#Вычисляет площадь прямоугольного треугольника

#Параметры:
#    a (int): катет треугольника
#    b (int): высота, опущенная к катету a

#Возвращаемое значение:
#    area (int, int): площадь прямоугольного треугольника

    return a * h / 2

def perimeter(a, b, c):
#Вычисляет периметр прямоугольного треугольника

#Параметры:
#    a (int): первая сторона треугольника
#    b (int): вторая сторона треугольника
#    c (int): третья сторона треугольника
#Возвращаемое значение:
#    perimeter(int, int, int): периметр треугольника

    return a + b + c