def area(a, h):
    '''
    Возвращает периметр треугольника по алгебраической формуле.
    Параметры:
        a (int): десятичное число
        h (int): десятичное число
    Возвращаемое значение:
        a * h / 2 (int): значение вычисленного периметра
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по алгебраической формуле.
    Параметры:
        a (int): десятичное число
        b (int): десятичное число
        c (int): десятичное число
    Возвращаемое значение:
        a + b + c (int): значение вычисленного периметра
    '''
    return a + b + c 