def area(a, h):
    '''
    Возвращает площадь треугольника.

        Параметры:
            a(int): сторона треугольника
            b(int): высота треугольника 
        
        Возвращенное значение:
            a * h / 2 (int): площадь треугольника 
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

        Параметры:
            a(int): сторона a треугольника
            b(int): сторона b треугольника 
            c(int): сторона c треугольника
        
        Возвращенное значение:
            a + b + c (int): периметр треугольника 
    '''
    return a + b + c