def area(a, h):
    '''
    Принимает числа a и h, возвращает произведение чисел a и h деленного на 2
        Параметры:
            a (int): десятичное число
            h (int): десятичное число
        Возвращаемое значение:
            area (int): произведение чисел a и h деленного на 2
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Принимает числа a, b и c, возвращает сумму чисел a, b и c
        Параметры:
            a (int): десятичное число
            b (int): десятичное число
            с (int): жесятичное число
        Возвращаемое значение:
            perimeter (int): сумма чисел a, b и c
    '''
    return a + b + c 