def area(a, h):
    '''
    Возвращает произведение двух чисел, уменьшенное вдвое.
    :param a: первое десятичное число
    :param h: второе десятичное число
    :return: число, состоящее из произведения двух входных чисел, уменьшенного вдвое.
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Возвращает сумму трёх чисел.
    :param a: первое десятичное число
    :param b: второе десятичное число
    :param c: третье десятичное число
    :return: число, состоящее из суммы трёх входных десятичных чисел.
    '''
    return a + b + c
 