def area(a, h):
    '''
            Возвращает площадь треугольника по длине основания и длине высоты, проведенной к основанию.

                Параметры:
                    a (int): длина основания треугольника.
                    h (int): длина высоты, проведенной к основанию треугольника.

                Возвращаемое значение:
                    area (int): площадь треугольника по высоте и основанию.
    '''
    return a * h / 2
def perimeter(a, b, c):
    '''
            Возвращает периметр треугольника по трем сторонам.

                Параметры:
                    a (int): сторона треугольника
                    b (int): сторона треугольника
                    c (int): сторона треугольника

                Возвращаемое значение:
                    perimetr (int): периметр треугольника по трем сторонам.
    '''
    return a + b + c
