def area(a, h):
    """ Возвращает площадь треугольника
            Параметры:
                a (int): одна сторона треугольника
                h (int): высота опущенная на сторону a
            Возвращаемое значение:
                area (int): площадь треугольника
    """
    return a * h / 2


def perimeter(a, b, c):
    """ Возвращает периметр треугольника
            Параметры:
                a (int): одна сторона треугольника
                b (int): вторая сторона треугольника
                c (int): третья сторона треугольника
            Возвращаемое значение:
                perimeter (int): периметр треугольника
    """
    return a + b + c
