def area(a, h):
    '''
    Определяем функцию area - площадь, которая принимает значения a - сторона треугольника, h - высота треугольника

        Параметры:
            a (int) или (float) - целое число или число с плавающей точкой
            h (int) или (float) - целое число или число с плавающей точкой

        Возвращаемое значение:
            Площадь треугольника со значением (int) или (float)
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Определяем функцию area - периметр, которая принимает значения a - сторона треугольника, h - высота треугольника

        Параметры:
            a (int) или (float) - целое число или число с плавающей точкой
            h (int) или (float) - целое число или число с плавающей точкой

        Возвращаемое значение:
            Периметр треугольника со значением (int) или (float)
    '''
    return a + b + c 
