def area(a, h):
'''
     Возвращает площадь треугольника с указанной стороной и высотой, которая проведена к указанной стороне
     
         Параметры:
             a (int/float): длина стороны квадрата
             
         Возвращаемое значение:
             area (int / float): площадь треугольника с указанной стороной и высотой, которая проведена к указанной стороне
'''    
    return a * h / 2

def perimeter(a, b, c):
'''
     Возвращает периметр треугольника с указанными сторонами
     
         Параметры:
             a (int/float): длина первой стороны квадрата
             b (int/float): длина второй стороны квадрата
             c (int/float): длина третьей стороны квадрата
             
         Возвращаемое значение:
             perimeter (int / float): периметр треугольника с указанными сторонами
'''
    return a + b + c
